2. Create a family_members.xls file  (atleast 10 names, columns are FamilyMemberName*Relation)
Q1> create a dataframe which contains only your brothers and sisters list.
Q2> create a dataframe which contains only your parents list.
Q3> create a dataframe which not contains your parents list.
Q4> create a dataframe which not contains your brothers list.
Q5> create a dataframe which contains either your brothers list or parents list.
Q5> create a dataframe which contains your brothers list and parents list.

In [4]:
import pandas as pd
df=pd.read_excel(r"E:\Santhosh\pandas_assign10\Familymemberrelation.xlsx")
df

    Familymember Relation
0  Veera brahmam   Father
1    Ratnakumari   Mother
2      sravanthi   sister
3           hari  brother
4        sravani   sister
5         harsha  brother
6        supraja   sister

In [2]:
dfb=df[(df.Relation=="brother")]

In [3]:
dfb

  Familymember Relation
3         hari  brother
5       harsha  brother

In [4]:
dfs=df[(df.Relation=="sister")]

In [5]:
dfs

  Familymember Relation
2    sravanthi   sister
4      sravani   sister
6      supraja   sister

In [6]:
dfbs=df[(df.Relation=="brother") | (df.Relation=="sister")]

In [7]:
dfbs

  Familymember Relation
2    sravanthi   sister
3         hari  brother
4      sravani   sister
5       harsha  brother
6      supraja   sister

In [8]:
dfp=df[(df.Relation=="Mother") | (df.Relation=="Father")]

In [9]:
dfp

    Familymember Relation
0  Veera brahmam   Father
1    Ratnakumari   Mother

In [10]:
dfbs

  Familymember Relation
2    sravanthi   sister
3         hari  brother
4      sravani   sister
5       harsha  brother
6      supraja   sister

In [11]:
lst=["Father","Mother"]

df[~(df.Relation.isin(lst))]

  Familymember Relation
2    sravanthi   sister
3         hari  brother
4      sravani   sister
5       harsha  brother
6      supraja   sister

In [12]:
lst1=["brother"]
df[~(df.Relation.isin(lst1))]

    Familymember Relation
0  Veera brahmam   Father
1    Ratnakumari   Mother
2      sravanthi   sister
4        sravani   sister
6        supraja   sister

In [13]:
lst2=["brother","Father","Mother"]
df[df.Relation.isin(lst2)]

    Familymember Relation
0  Veera brahmam   Father
1    Ratnakumari   Mother
3           hari  brother
5         harsha  brother

3. Create a Vegfood_items.xlsx file  (atleast 10 names, columns are VegFoodName*Taste)
Q1>create a dataframe which are  soups items
Q2>create a dataframe which are curry items
Q3>create a dataframe which are fry items
Q4>create a dataframe which contains soups and fry items
Q5>create a dataframe which not contains soups and fry items
Q6>create a dataframe which contains either soup or fry items

In [14]:
import pandas as pd
df=pd.read_excel(r"E:\Santhosh\pandas_assign10\vegfoodtaste.xlsx")
df

        vegfood  taste
0        paneer  curry
1          aloo    fry
2      babycorn    fry
3      vegpulav    fry
4    gobimasala  curry
5  paneermasala   soup
6     mealmaker   soup

In [15]:
dfs=df[df.taste=="soup"]

In [16]:
dfs

        vegfood taste
5  paneermasala  soup
6     mealmaker  soup

In [17]:
dfc=df[df.taste=="curry"]

In [18]:
dfc

      vegfood  taste
0      paneer  curry
4  gobimasala  curry

In [19]:
dff=df[df.taste=="fry"]

In [20]:
dff

    vegfood taste
1      aloo   fry
2  babycorn   fry
3  vegpulav   fry

In [21]:
dfsf=df[(df.taste=="soup") | (df.taste=="fry")]

In [22]:
dfsf

        vegfood taste
1          aloo   fry
2      babycorn   fry
3      vegpulav   fry
5  paneermasala  soup
6     mealmaker  soup

In [23]:
lst=["soup","fry"]
df[~(df.taste.isin(lst))]

      vegfood  taste
0      paneer  curry
4  gobimasala  curry

In [24]:
lst1=["soup","fry"]
df[df.taste.isin(lst1)]

        vegfood taste
1          aloo   fry
2      babycorn   fry
3      vegpulav   fry
5  paneermasala  soup
6     mealmaker  soup

4. Create a NonVegfood_items.xlsx file  (atleast 10 names, columns are NonVegFoodName*Taste)
Q1>create a dataframe which contains only chicken items
Q2>create a dataframe which contains only mutton items
Q3>create a dataframe which contains only Fry items
Q4>create a dataframe which contains only Fry and chicken items
Q5>create a dataframe which not contains Fry and chicken items
Q6>create a dataframe which contains either Fry or mutton items

In [25]:
dict={"nonveg":("chicken","mutton","prawns","chicken","mutton","fish","mutton","fish"),
      "type":("fry","soup","soup","soup","fry","fry","fry","soup")}

In [26]:
import pandas
import pandas as pd
df=pd.DataFrame(dict)
df

    nonveg  type
0  chicken   fry
1   mutton  soup
2   prawns  soup
3  chicken  soup
4   mutton   fry
5     fish   fry
6   mutton   fry
7     fish  soup

In [27]:
dfch=df[df.nonveg=="chicken"]

In [28]:
dfch

    nonveg  type
0  chicken   fry
3  chicken  soup

In [29]:
dfm=df[df.nonveg=="mutton"]

In [30]:
dfm

   nonveg  type
1  mutton  soup
4  mutton   fry
6  mutton   fry

In [31]:
dffr=df[df.type=="fry"]

In [32]:
dffr

    nonveg type
0  chicken  fry
4   mutton  fry
5     fish  fry
6   mutton  fry

In [33]:
dffs=df[(df.type=="fry") | (df.nonveg=="chicken")]

In [34]:
dffs

    nonveg  type
0  chicken   fry
3  chicken  soup
4   mutton   fry
5     fish   fry
6   mutton   fry

In [35]:
lst=["fry","chicken"]
df[~((df.type.isin(lst))) | ~(df.nonveg.isin(lst))]

    nonveg  type
1   mutton  soup
2   prawns  soup
3  chicken  soup
4   mutton   fry
5     fish   fry
6   mutton   fry
7     fish  soup

In [36]:
dffm=df[(df.type=="fry") | (df.nonveg=="mutton")]

In [37]:
dffm

    nonveg  type
0  chicken   fry
1   mutton  soup
4   mutton   fry
5     fish   fry
6   mutton   fry